---
kind: property
id: P:Autodesk.Revit.DB.NavisworksExportOptions.ExportRoomAsAttribute
source: html/eef60c23-5cd6-8d69-d75e-54b8c8d24674.htm
---
# Autodesk.Revit.DB.NavisworksExportOptions.ExportRoomAsAttribute Property

True to export data for each room converts into a single shared room attribute, false otherwise.
 Default value is true.

## Syntax (C#)
```csharp
public bool ExportRoomAsAttribute { get; set; }
```